app/controllers/comments_controller.rb

  def new
    @comment = Comment.new
    @post = Post.find(params[:post_id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)

  def create
    @comment = Comment.new(params[:comment])
    @comment.user = current_user

    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`created_at`, `body`, `updated_at`, `post_id`, `user_id`) VALUES('2010-10-05 02:11:34', 'WOOT WOOT IN THE POOT POOT COMMENT\r\nWOOT WOOT IN THE POOT POOT COMMENTWOOT WOOT IN THE POOT POOT COMMENT', '2010-10-05 02:11:34', NULL, 1)