app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "title", "body", "draft", "updated_at", "posted_at") VALUES('2010-10-20 17:46:41', 'Other sources claim that some old shit is resurfacing as a result of the new shit', 'I mean like.. just when i thought it wasn''t gonna change... blam some old shit creepin back up.I mean like.. just when i thought it wasn''t gonna change... blam some old shit creepin back up.
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 3)
UPDATE "posts" SET "updated_at" = '2010-10-20 17:57:00', "body" = 'This is the specifics of the new shit.. believe me when I say.. it''s fo real son.This is the specifics of the new shit.. believe me when I say.. it''s fo real son. check out this crazy ass shit by going to www.google.com or something
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])