app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "password_salt", "persistence_token", "email") VALUES('2010-10-08 00:48:13', '6c4c51b3e1d6c0e4348a2e4f0ba967600da7f2048a9ee0b42817ddad443d292272b29f901f5380958fce835a58529b754bdcb0960ce3671c18b565ff5dbaba37', '2010-10-08 00:48:13', 'aUr7v1s8OQdVh1u93Os', 'e3ab90afc007465c47aa37294f072c8eccf6c9c1fd9c41c6388639841ceba0c548f46735c0746942b19777607bcbbb64dee972eeceacd4311ef7247d6bcc8473', 'itsianhawk@gmail.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save